In [ ]:
import pandas as pd  
import numpy as np   
import matplotlib.pyplot as plt 
import seaborn as sns

In [ ]:
dict1={'names':['mani','mohan',np.nan,'mahesh'],
      'age':[20,21,22,np.nan],
      'city':[np.nan,'hyd','bvrm','mumbai',]}

In [3]:
data1=pd.DataFrame(dict1)
data1

    names   age    city
0    mani  20.0     NaN
1   mohan  21.0     hyd
2     NaN  22.0    bvrm
3  mahesh   NaN  mumbai

In [4]:
data1.isnull().sum()
# every column has one missing value is their

names    1
age      1
city     1
dtype: int64

In [5]:
data1.isnull().sum()/len(data1)

names    0.25
age      0.25
city     0.25
dtype: float64

In [6]:
data1.isnull().sum()*100/len(data1)

names    25.0
age      25.0
city     25.0
dtype: float64

In [7]:
dict2={'names':['mani','mohan',None,'mahesh'],
      'age':[20,21,22,None],
      'city':[None,'hyd','bvrm','mumbai',]}

In [8]:
data2=pd.DataFrame(dict2)
data2

    names   age    city
0    mani  20.0    None
1   mohan  21.0     hyd
2    None  22.0    bvrm
3  mahesh   NaN  mumbai

In [9]:
data2.isnull().sum()

names    1
age      1
city     1
dtype: int64

In [10]:
dict3={'names':['mani','mohan','null','mahesh'],
      'age':[20,21,22,'null'],
      'city':['null','hyd','bvrm','mumbai',]}

In [11]:
data3=pd.DataFrame(dict3)
data3

    names   age    city
0    mani    20    null
1   mohan    21     hyd
2    null    22    bvrm
3  mahesh  null  mumbai

**Method-1**

> Fill the missing  values with random numbers

dataframe name=data1

method name:fillaa

In [12]:
data1.fillna(40)

    names   age    city
0    mani  20.0      40
1   mohan  21.0     hyd
2      40  22.0    bvrm
3  mahesh  40.0  mumbai

**method-2**
 
> Fill the missing values with random numbers on specific columns

In [13]:
data1['names'].fillna('anil',inplace=True)
data1['age'].fillna(25,inplace=True)
data1['city'].fillna('bhimavaram',inplace=True)
data1

    names   age        city
0    mani  20.0  bhimavaram
1   mohan  21.0         hyd
2    anil  22.0        bvrm
3  mahesh  25.0      mumbai

In [14]:
# read the data again
dict1={'names':['mani','mohan',np.nan,'mahesh'],
      'age':[20,21,22,np.nan],
      'city':[np.nan,'hyd','bvrm','mumbai',]}
data1=pd.DataFrame(dict1)
data1

    names   age    city
0    mani  20.0     NaN
1   mohan  21.0     hyd
2     NaN  22.0    bvrm
3  mahesh   NaN  mumbai

**Method-3**

- pad

- bfill

- backfill

- ffill

In [15]:
data1.fillna(method='backfill')
# names index 2 is missed value 
#       it will replace by index 3 values
# age index 3 has missed value
#     we dont have index 4, so that value is nan
# city  index 0 has missed value
#       it replace with index 1 value

    names   age    city
0    mani  20.0     hyd
1   mohan  21.0     hyd
2  mahesh  22.0    bvrm
3  mahesh   NaN  mumbai

In [16]:
data1.fillna(method='bfill')

    names   age    city
0    mani  20.0     hyd
1   mohan  21.0     hyd
2  mahesh  22.0    bvrm
3  mahesh   NaN  mumbai

In [17]:
data1.fillna(method='pad')

    names   age    city
0    mani  20.0     NaN
1   mohan  21.0     hyd
2   mohan  22.0    bvrm
3  mahesh  22.0  mumbai

In [18]:
data1.fillna(method='ffill')

    names   age    city
0    mani  20.0     NaN
1   mohan  21.0     hyd
2   mohan  22.0    bvrm
3  mahesh  22.0  mumbai

- bfill and backfill both are same 
- pad and ffill both are same

**metrhod-4**

- mean
- median
- mode

In [19]:
data1

    names   age    city
0    mani  20.0     NaN
1   mohan  21.0     hyd
2     NaN  22.0    bvrm
3  mahesh   NaN  mumbai

In [20]:
age_mean=data1['age'].mean()
age_mean

21.0

In [21]:
data1['age'].fillna(age_mean)
# insted of providing a random number 
# we are filling with mean of the data

0    20.0
1    21.0
2    22.0
3    21.0
Name: age, dtype: float64

In [22]:
age_median=data1['age'].median()
age_median

21.0

In [23]:
data1['age'].fillna(age_median)
#  we are filling with median of the data
# it will not effect in our data and outliers

0    20.0
1    21.0
2    22.0
3    21.0
Name: age, dtype: float64

In [24]:
age_mode=data1['age'].mode()
age_mode

0    20.0
1    21.0
2    22.0
Name: age, dtype: float64

In [25]:
data1['age'].fillna(age_mode)

0    20.0
1    21.0
2    22.0
3     NaN
Name: age, dtype: float64

**Method-5**



**KNN imputer**

> Knn: k nearest neighbour
- in the knn imputer insted of taking mean of all the values
- will choosse neigbour data
- will take those mean only
- it is only for numerical data

KNN imputer

<img src="https://vitalflux.com/wp-content/uploads/2020/12/Euclidean-Distance-formula-2.png" alt="Different Types of Distance Measures in Machine Learning - Analytics Yogi" class=" nofocus" tabindex="0" aria-label="Different Types of Distance Measures in Machine Learning - Analytics Yogi" role="button" data-bm="292">

- n_neighbors is parameters can choose usert
- if we dont choose by default ut will takes as=5

In [28]:
from sklearn.impute import KNNImputer
knn=KNNImputer(n_neighbors=2)
knn.fit_transform(data1[['age']])

array([[20.],
       [21.],
       [22.],
       [21.]])

In [29]:
data1

    names   age    city
0    mani  20.0     NaN
1   mohan  21.0     hyd
2     NaN  22.0    bvrm
3  mahesh   NaN  mumbai

**Method-6**
- based on other columns
- some times all above method will not provide good justification 
- at that time we need to check other columns dependency also
- most of the time will pick a column which have highest correlation